Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pmc.h
/* -------- PMC_WPMR : (PMC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define PMC_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (PMC_WPMR) Write Protection Enable Position */
#define PMC_WPMR_WPEN_Msk                     (_UINT32_(0x1) << PMC_WPMR_WPEN_Pos)                 /* (PMC_WPMR) Write Protection Enable Mask */
#define PMC_WPMR_WPEN(value)                  (PMC_WPMR_WPEN_Msk & (_UINT32_(value) << PMC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the PMC_WPMR register */
#define PMC_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (PMC_WPMR) Write Protection Interrupt Enable Position */
#define PMC_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << PMC_WPMR_WPITEN_Pos)               /* (PMC_WPMR) Write Protection Interrupt Enable Mask */
#define PMC_WPMR_WPITEN(value)                (PMC_WPMR_WPITEN_Msk & (_UINT32_(value) << PMC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the PMC_WPMR register */
#define PMC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (PMC_WPMR) Write Protection Key Position */
#define PMC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << PMC_WPMR_WPKEY_Pos)           /* (PMC_WPMR) Write Protection Key Mask */
#define PMC_WPMR_WPKEY(value)                 (PMC_WPMR_WPKEY_Msk & (_UINT32_(value) << PMC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PMC_WPMR register */
#define   PMC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x504D43)                                   /* (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PMC_WPMR_WPKEY_PASSWD                 (PMC_WPMR_WPKEY_PASSWD_Val << PMC_WPMR_WPKEY_Pos)    /* (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PMC_WPMR_Msk                          _UINT32_(0xFFFFFF03)                                 /* (PMC_WPMR) Register Mask  */


/* -------- PMC_WPSR : (PMC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define PMC_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (PMC_WPSR) Write Protection Violation Status Position */
#define PMC_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PMC_WPSR_WPVS_Pos)                 /* (PMC_WPSR) Write Protection Violation Status Mask */
#define PMC_WPSR_WPVS(value)                  (PMC_WPSR_WPVS_Msk & (_UINT32_(value) << PMC_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PMC_WPSR register */
#define PMC_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (PMC_WPSR) Write Protection Violation Source Position */
#define PMC_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PMC_WPSR_WPVSRC_Pos)            /* (PMC_WPSR) Write Protection Violation Source Mask */
#define PMC_WPSR_WPVSRC(value)                (PMC_WPSR_WPVSRC_Msk & (_UINT32_(value) << PMC_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PMC_WPSR register */
#define PMC_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (PMC_WPSR) Register Mask  */


/* -------- PMC_PCR : (PMC Offset: 0x10C) (R/W 32) Peripheral Control Register -------- */
#define PMC_PCR_PID_Pos                       _UINT32_(0)                                          /* (PMC_PCR) Peripheral ID Position */
#define PMC_PCR_PID_Msk                       (_UINT32_(0x7F) << PMC_PCR_PID_Pos)                  /* (PMC_PCR) Peripheral ID Mask */
#define PMC_PCR_PID(value)                    (PMC_PCR_PID_Msk & (_UINT32_(value) << PMC_PCR_PID_Pos)) /* Assigment of value for PID in the PMC_PCR register */
#define PMC_PCR_GCLKCSS_Pos                   _UINT32_(8)                                          /* (PMC_PCR) Generic Clock Source Selection Position */
#define PMC_PCR_GCLKCSS_Msk                   (_UINT32_(0x7) << PMC_PCR_GCLKCSS_Pos)               /* (PMC_PCR) Generic Clock Source Selection Mask */
#define PMC_PCR_GCLKCSS(value)                (PMC_PCR_GCLKCSS_Msk & (_UINT32_(value) << PMC_PCR_GCLKCSS_Pos)) /* Assigment of value for GCLKCSS in the PMC_PCR register */
#define   PMC_PCR_GCLKCSS_SLOW_CLK_Val        _UINT32_(0x0)                                        /* (PMC_PCR) MD_SLCK is selected  */
#define   PMC_PCR_GCLKCSS_MAIN_CLK_Val        _UINT32_(0x1)                                        /* (PMC_PCR) MAINCK is selected  */
#define   PMC_PCR_GCLKCSS_PLLA_CLK_Val        _UINT32_(0x2)                                        /* (PMC_PCR) PLLACK is selected  */
#define   PMC_PCR_GCLKCSS_PLLB_CLK_Val        _UINT32_(0x3)                                        /* (PMC_PCR) PLLBCK is selected  */
#define   PMC_PCR_GCLKCSS_MCK_CLK_Val         _UINT32_(0x4)                                        /* (PMC_PCR) MCK is selected  */
#define   PMC_PCR_GCLKCSS_MCK_RC2_Val         _UINT32_(0x5)                                        /* (PMC_PCR) RC2 is selected  */
#define PMC_PCR_GCLKCSS_SLOW_CLK              (PMC_PCR_GCLKCSS_SLOW_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) MD_SLCK is selected Position  */
#define PMC_PCR_GCLKCSS_MAIN_CLK              (PMC_PCR_GCLKCSS_MAIN_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) MAINCK is selected Position  */
#define PMC_PCR_GCLKCSS_PLLA_CLK              (PMC_PCR_GCLKCSS_PLLA_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) PLLACK is selected Position  */
#define PMC_PCR_GCLKCSS_PLLB_CLK              (PMC_PCR_GCLKCSS_PLLB_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) PLLBCK is selected Position  */
#define PMC_PCR_GCLKCSS_MCK_CLK               (PMC_PCR_GCLKCSS_MCK_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) MCK is selected Position  */
#define PMC_PCR_GCLKCSS_MCK_RC2               (PMC_PCR_GCLKCSS_MCK_RC2_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) RC2 is selected Position  */
#define PMC_PCR_CMD_Pos                       _UINT32_(12)                                         /* (PMC_PCR) Command Position */
#define PMC_PCR_CMD_Msk                       (_UINT32_(0x1) << PMC_PCR_CMD_Pos)                   /* (PMC_PCR) Command Mask */
#define PMC_PCR_CMD(value)                    (PMC_PCR_CMD_Msk & (_UINT32_(value) << PMC_PCR_CMD_Pos)) /* Assigment of value for CMD in the PMC_PCR register */
#define PMC_PCR_GCLKDIV_Pos                   _UINT32_(20)                                         /* (PMC_PCR) Generic Clock Division Ratio Position */
#define PMC_PCR_GCLKDIV_Msk                   (_UINT32_(0xFF) << PMC_PCR_GCLKDIV_Pos)              /* (PMC_PCR) Generic Clock Division Ratio Mask */
#define PMC_PCR_GCLKDIV(value)                (PMC_PCR_GCLKDIV_Msk & (_UINT32_(value) << PMC_PCR_GCLKDIV_Pos)) /* Assigment of value for GCLKDIV in the PMC_PCR register */
#define PMC_PCR_EN_Pos                        _UINT32_(28)                                         /* (PMC_PCR) Enable Position */
#define PMC_PCR_EN_Msk                        (_UINT32_(0x1) << PMC_PCR_EN_Pos)                    /* (PMC_PCR) Enable Mask */
#define PMC_PCR_EN(value)                     (PMC_PCR_EN_Msk & (_UINT32_(value) << PMC_PCR_EN_Pos)) /* Assigment of value for EN in the PMC_PCR register */
#define PMC_PCR_GCLKEN_Pos                    _UINT32_(29)                                         /* (PMC_PCR) Generic Clock Enable Position */
#define PMC_PCR_GCLKEN_Msk                    (_UINT32_(0x1) << PMC_PCR_GCLKEN_Pos)                /* (PMC_PCR) Generic Clock Enable Mask */
#define PMC_PCR_GCLKEN(value)                 (PMC_PCR_GCLKEN_Msk & (_UINT32_(value) << PMC_PCR_GCLKEN_Pos)) /* Assigment of value for GCLKEN in the PMC_PCR register */
#define PMC_PCR_Msk                           _UINT32_(0x3FF0177F)                                 /* (PMC_PCR) Register Mask  */


/* -------- PMC_OCR1 : (PMC Offset: 0x110) (R/W 32) Oscillator Calibration Register -------- */
#define PMC_OCR1_CAL4_Pos                     _UINT32_(0)                                          /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR1_CAL4_Msk                     (_UINT32_(0x7F) << PMC_OCR1_CAL4_Pos)                /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR1_CAL4(value)                  (PMC_OCR1_CAL4_Msk & (_UINT32_(value) << PMC_OCR1_CAL4_Pos)) /* Assigment of value for CAL4 in the PMC_OCR1 register */
#define PMC_OCR1_SEL4_Pos                     _UINT32_(7)                                          /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR1_SEL4_Msk                     (_UINT32_(0x1) << PMC_OCR1_SEL4_Pos)                 /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR1_SEL4(value)                  (PMC_OCR1_SEL4_Msk & (_UINT32_(value) << PMC_OCR1_SEL4_Pos)) /* Assigment of value for SEL4 in the PMC_OCR1 register */
#define PMC_OCR1_CAL8_Pos                     _UINT32_(8)                                          /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR1_CAL8_Msk                     (_UINT32_(0x7F) << PMC_OCR1_CAL8_Pos)                /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR1_CAL8(value)                  (PMC_OCR1_CAL8_Msk & (_UINT32_(value) << PMC_OCR1_CAL8_Pos)) /* Assigment of value for CAL8 in the PMC_OCR1 register */
#define PMC_OCR1_SEL8_Pos                     _UINT32_(15)                                         /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR1_SEL8_Msk                     (_UINT32_(0x1) << PMC_OCR1_SEL8_Pos)                 /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR1_SEL8(value)                  (PMC_OCR1_SEL8_Msk & (_UINT32_(value) << PMC_OCR1_SEL8_Pos)) /* Assigment of value for SEL8 in the PMC_OCR1 register */
#define PMC_OCR1_CAL12_Pos                    _UINT32_(16)                                         /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR1_CAL12_Msk                    (_UINT32_(0x7F) << PMC_OCR1_CAL12_Pos)               /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR1_CAL12(value)                 (PMC_OCR1_CAL12_Msk & (_UINT32_(value) << PMC_OCR1_CAL12_Pos)) /* Assigment of value for CAL12 in the PMC_OCR1 register */
#define PMC_OCR1_SEL10_Pos                    _UINT32_(23)                                         /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR1_SEL10_Msk                    (_UINT32_(0x1) << PMC_OCR1_SEL10_Pos)                /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR1_SEL10(value)                 (PMC_OCR1_SEL10_Msk & (_UINT32_(value) << PMC_OCR1_SEL10_Pos)) /* Assigment of value for SEL10 in the PMC_OCR1 register */
#define PMC_OCR1_CAL10_Pos                    _UINT32_(24)                                         /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR1_CAL10_Msk                    (_UINT32_(0x7F) << PMC_OCR1_CAL10_Pos)               /* (PMC_OCR1) Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR1_CAL10(value)                 (PMC_OCR1_CAL10_Msk & (_UINT32_(value) << PMC_OCR1_CAL10_Pos)) /* Assigment of value for CAL10 in the PMC_OCR1 register */
#define PMC_OCR1_SEL12_Pos                    _UINT32_(31)                                         /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR1_SEL12_Msk                    (_UINT32_(0x1) << PMC_OCR1_SEL12_Pos)                /* (PMC_OCR1) Selection of Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR1_SEL12(value)                 (PMC_OCR1_SEL12_Msk & (_UINT32_(value) << PMC_OCR1_SEL12_Pos)) /* Assigment of value for SEL12 in the PMC_OCR1 register */
#define PMC_OCR1_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PMC_OCR1) Register Mask  */


/* -------- PMC_PMMR : (PMC Offset: 0x130) (R/W 32) PLL Maximum Multiplier Value Register -------- */
#define PMC_PMMR_PLLA_MMAX_Pos                _UINT32_(0)                                          /* (PMC_PMMR) PLLA Maximum Allowed Multiplier Value Position */
#define PMC_PMMR_PLLA_MMAX_Msk                (_UINT32_(0x7FF) << PMC_PMMR_PLLA_MMAX_Pos)          /* (PMC_PMMR) PLLA Maximum Allowed Multiplier Value Mask */
#define PMC_PMMR_PLLA_MMAX(value)             (PMC_PMMR_PLLA_MMAX_Msk & (_UINT32_(value) << PMC_PMMR_PLLA_MMAX_Pos)) /* Assigment of value for PLLA_MMAX in the PMC_PMMR register */
#define PMC_PMMR_PLLB_MMAX_Pos                _UINT32_(16)                                         /* (PMC_PMMR) PLLB Maximum Allowed Multiplier Value Position */
#define PMC_PMMR_PLLB_MMAX_Msk                (_UINT32_(0x7FF) << PMC_PMMR_PLLB_MMAX_Pos)          /* (PMC_PMMR) PLLB Maximum Allowed Multiplier Value Mask */
#define PMC_PMMR_PLLB_MMAX(value)             (PMC_PMMR_PLLB_MMAX_Msk & (_UINT32_(value) << PMC_PMMR_PLLB_MMAX_Pos)) /* Assigment of value for PLLB_MMAX in the PMC_PMMR register */
#define PMC_PMMR_Msk                          _UINT32_(0x07FF07FF)                                 /* (PMC_PMMR) Register Mask  */


