Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pmc.h
/* -------- PMC_CPULIM : (PMC Offset: 0x160) (R/W 32) CPU Monitor Limits Register -------- */
#define PMC_CPULIM_CPU_LOW_IT_Pos             _UINT32_(0)                                          /* (PMC_CPULIM) CPU Monitoring Low IT Limit Position */
#define PMC_CPULIM_CPU_LOW_IT_Msk             (_UINT32_(0xFF) << PMC_CPULIM_CPU_LOW_IT_Pos)        /* (PMC_CPULIM) CPU Monitoring Low IT Limit Mask */
#define PMC_CPULIM_CPU_LOW_IT(value)          (PMC_CPULIM_CPU_LOW_IT_Msk & (_UINT32_(value) << PMC_CPULIM_CPU_LOW_IT_Pos)) /* Assigment of value for CPU_LOW_IT in the PMC_CPULIM register */
#define PMC_CPULIM_CPU_HIGH_IT_Pos            _UINT32_(8)                                          /* (PMC_CPULIM) CPU Monitoring High IT Limit Position */
#define PMC_CPULIM_CPU_HIGH_IT_Msk            (_UINT32_(0xFF) << PMC_CPULIM_CPU_HIGH_IT_Pos)       /* (PMC_CPULIM) CPU Monitoring High IT Limit Mask */
#define PMC_CPULIM_CPU_HIGH_IT(value)         (PMC_CPULIM_CPU_HIGH_IT_Msk & (_UINT32_(value) << PMC_CPULIM_CPU_HIGH_IT_Pos)) /* Assigment of value for CPU_HIGH_IT in the PMC_CPULIM register */
#define PMC_CPULIM_CPU_LOW_RES_Pos            _UINT32_(16)                                         /* (PMC_CPULIM) CPU Monitoring Low RESET Limit Position */
#define PMC_CPULIM_CPU_LOW_RES_Msk            (_UINT32_(0xFF) << PMC_CPULIM_CPU_LOW_RES_Pos)       /* (PMC_CPULIM) CPU Monitoring Low RESET Limit Mask */
#define PMC_CPULIM_CPU_LOW_RES(value)         (PMC_CPULIM_CPU_LOW_RES_Msk & (_UINT32_(value) << PMC_CPULIM_CPU_LOW_RES_Pos)) /* Assigment of value for CPU_LOW_RES in the PMC_CPULIM register */
#define PMC_CPULIM_CPU_HIGH_RES_Pos           _UINT32_(24)                                         /* (PMC_CPULIM) CPU Monitoring High Reset Limit Position */
#define PMC_CPULIM_CPU_HIGH_RES_Msk           (_UINT32_(0xFF) << PMC_CPULIM_CPU_HIGH_RES_Pos)      /* (PMC_CPULIM) CPU Monitoring High Reset Limit Mask */
#define PMC_CPULIM_CPU_HIGH_RES(value)        (PMC_CPULIM_CPU_HIGH_RES_Msk & (_UINT32_(value) << PMC_CPULIM_CPU_HIGH_RES_Pos)) /* Assigment of value for CPU_HIGH_RES in the PMC_CPULIM register */
#define PMC_CPULIM_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PMC_CPULIM) Register Mask  */


/* -------- PMC_CSR0 : (PMC Offset: 0x170) ( R/ 32) Peripheral Clock Status Register 0 -------- */
#define PMC_CSR0_PID7_Pos                     _UINT32_(7)                                          /* (PMC_CSR0) Peripheral Clock 7 Status Position */
#define PMC_CSR0_PID7_Msk                     (_UINT32_(0x1) << PMC_CSR0_PID7_Pos)                 /* (PMC_CSR0) Peripheral Clock 7 Status Mask */
#define PMC_CSR0_PID7(value)                  (PMC_CSR0_PID7_Msk & (_UINT32_(value) << PMC_CSR0_PID7_Pos)) /* Assigment of value for PID7 in the PMC_CSR0 register */
#define PMC_CSR0_PID8_Pos                     _UINT32_(8)                                          /* (PMC_CSR0) Peripheral Clock 8 Status Position */
#define PMC_CSR0_PID8_Msk                     (_UINT32_(0x1) << PMC_CSR0_PID8_Pos)                 /* (PMC_CSR0) Peripheral Clock 8 Status Mask */
#define PMC_CSR0_PID8(value)                  (PMC_CSR0_PID8_Msk & (_UINT32_(value) << PMC_CSR0_PID8_Pos)) /* Assigment of value for PID8 in the PMC_CSR0 register */
#define PMC_CSR0_PID9_Pos                     _UINT32_(9)                                          /* (PMC_CSR0) Peripheral Clock 9 Status Position */
#define PMC_CSR0_PID9_Msk                     (_UINT32_(0x1) << PMC_CSR0_PID9_Pos)                 /* (PMC_CSR0) Peripheral Clock 9 Status Mask */
#define PMC_CSR0_PID9(value)                  (PMC_CSR0_PID9_Msk & (_UINT32_(value) << PMC_CSR0_PID9_Pos)) /* Assigment of value for PID9 in the PMC_CSR0 register */
#define PMC_CSR0_PID10_Pos                    _UINT32_(10)                                         /* (PMC_CSR0) Peripheral Clock 10 Status Position */
#define PMC_CSR0_PID10_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID10_Pos)                /* (PMC_CSR0) Peripheral Clock 10 Status Mask */
#define PMC_CSR0_PID10(value)                 (PMC_CSR0_PID10_Msk & (_UINT32_(value) << PMC_CSR0_PID10_Pos)) /* Assigment of value for PID10 in the PMC_CSR0 register */
#define PMC_CSR0_PID13_Pos                    _UINT32_(13)                                         /* (PMC_CSR0) Peripheral Clock 13 Status Position */
#define PMC_CSR0_PID13_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID13_Pos)                /* (PMC_CSR0) Peripheral Clock 13 Status Mask */
#define PMC_CSR0_PID13(value)                 (PMC_CSR0_PID13_Msk & (_UINT32_(value) << PMC_CSR0_PID13_Pos)) /* Assigment of value for PID13 in the PMC_CSR0 register */
#define PMC_CSR0_PID14_Pos                    _UINT32_(14)                                         /* (PMC_CSR0) Peripheral Clock 14 Status Position */
#define PMC_CSR0_PID14_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID14_Pos)                /* (PMC_CSR0) Peripheral Clock 14 Status Mask */
#define PMC_CSR0_PID14(value)                 (PMC_CSR0_PID14_Msk & (_UINT32_(value) << PMC_CSR0_PID14_Pos)) /* Assigment of value for PID14 in the PMC_CSR0 register */
#define PMC_CSR0_PID22_Pos                    _UINT32_(22)                                         /* (PMC_CSR0) Peripheral Clock 22 Status Position */
#define PMC_CSR0_PID22_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID22_Pos)                /* (PMC_CSR0) Peripheral Clock 22 Status Mask */
#define PMC_CSR0_PID22(value)                 (PMC_CSR0_PID22_Msk & (_UINT32_(value) << PMC_CSR0_PID22_Pos)) /* Assigment of value for PID22 in the PMC_CSR0 register */
#define PMC_CSR0_PID23_Pos                    _UINT32_(23)                                         /* (PMC_CSR0) Peripheral Clock 23 Status Position */
#define PMC_CSR0_PID23_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID23_Pos)                /* (PMC_CSR0) Peripheral Clock 23 Status Mask */
#define PMC_CSR0_PID23(value)                 (PMC_CSR0_PID23_Msk & (_UINT32_(value) << PMC_CSR0_PID23_Pos)) /* Assigment of value for PID23 in the PMC_CSR0 register */
#define PMC_CSR0_PID24_Pos                    _UINT32_(24)                                         /* (PMC_CSR0) Peripheral Clock 24 Status Position */
#define PMC_CSR0_PID24_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID24_Pos)                /* (PMC_CSR0) Peripheral Clock 24 Status Mask */
#define PMC_CSR0_PID24(value)                 (PMC_CSR0_PID24_Msk & (_UINT32_(value) << PMC_CSR0_PID24_Pos)) /* Assigment of value for PID24 in the PMC_CSR0 register */
#define PMC_CSR0_PID25_Pos                    _UINT32_(25)                                         /* (PMC_CSR0) Peripheral Clock 25 Status Position */
#define PMC_CSR0_PID25_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID25_Pos)                /* (PMC_CSR0) Peripheral Clock 25 Status Mask */
#define PMC_CSR0_PID25(value)                 (PMC_CSR0_PID25_Msk & (_UINT32_(value) << PMC_CSR0_PID25_Pos)) /* Assigment of value for PID25 in the PMC_CSR0 register */
#define PMC_CSR0_PID26_Pos                    _UINT32_(26)                                         /* (PMC_CSR0) Peripheral Clock 26 Status Position */
#define PMC_CSR0_PID26_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID26_Pos)                /* (PMC_CSR0) Peripheral Clock 26 Status Mask */
#define PMC_CSR0_PID26(value)                 (PMC_CSR0_PID26_Msk & (_UINT32_(value) << PMC_CSR0_PID26_Pos)) /* Assigment of value for PID26 in the PMC_CSR0 register */
#define PMC_CSR0_PID27_Pos                    _UINT32_(27)                                         /* (PMC_CSR0) Peripheral Clock 27 Status Position */
#define PMC_CSR0_PID27_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID27_Pos)                /* (PMC_CSR0) Peripheral Clock 27 Status Mask */
#define PMC_CSR0_PID27(value)                 (PMC_CSR0_PID27_Msk & (_UINT32_(value) << PMC_CSR0_PID27_Pos)) /* Assigment of value for PID27 in the PMC_CSR0 register */
#define PMC_CSR0_PID28_Pos                    _UINT32_(28)                                         /* (PMC_CSR0) Peripheral Clock 28 Status Position */
#define PMC_CSR0_PID28_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID28_Pos)                /* (PMC_CSR0) Peripheral Clock 28 Status Mask */
#define PMC_CSR0_PID28(value)                 (PMC_CSR0_PID28_Msk & (_UINT32_(value) << PMC_CSR0_PID28_Pos)) /* Assigment of value for PID28 in the PMC_CSR0 register */
#define PMC_CSR0_PID29_Pos                    _UINT32_(29)                                         /* (PMC_CSR0) Peripheral Clock 29 Status Position */
#define PMC_CSR0_PID29_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID29_Pos)                /* (PMC_CSR0) Peripheral Clock 29 Status Mask */
#define PMC_CSR0_PID29(value)                 (PMC_CSR0_PID29_Msk & (_UINT32_(value) << PMC_CSR0_PID29_Pos)) /* Assigment of value for PID29 in the PMC_CSR0 register */
#define PMC_CSR0_PID30_Pos                    _UINT32_(30)                                         /* (PMC_CSR0) Peripheral Clock 30 Status Position */
#define PMC_CSR0_PID30_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID30_Pos)                /* (PMC_CSR0) Peripheral Clock 30 Status Mask */
#define PMC_CSR0_PID30(value)                 (PMC_CSR0_PID30_Msk & (_UINT32_(value) << PMC_CSR0_PID30_Pos)) /* Assigment of value for PID30 in the PMC_CSR0 register */
#define PMC_CSR0_PID31_Pos                    _UINT32_(31)                                         /* (PMC_CSR0) Peripheral Clock 31 Status Position */
#define PMC_CSR0_PID31_Msk                    (_UINT32_(0x1) << PMC_CSR0_PID31_Pos)                /* (PMC_CSR0) Peripheral Clock 31 Status Mask */
#define PMC_CSR0_PID31(value)                 (PMC_CSR0_PID31_Msk & (_UINT32_(value) << PMC_CSR0_PID31_Pos)) /* Assigment of value for PID31 in the PMC_CSR0 register */
#define PMC_CSR0_Msk                          _UINT32_(0xFFC06780)                                 /* (PMC_CSR0) Register Mask  */

#define PMC_CSR0_PID_Pos                      _UINT32_(7)                                          /* (PMC_CSR0 Position) Peripheral Clock 3x Status */
#define PMC_CSR0_PID_Msk                      (_UINT32_(0xFFFF) << PMC_CSR0_PID_Pos)               /* (PMC_CSR0 Mask) PID */
#define PMC_CSR0_PID(value)                   (PMC_CSR0_PID_Msk & (_UINT32_(value) << PMC_CSR0_PID_Pos)) 

/* -------- PMC_CSR1 : (PMC Offset: 0x174) ( R/ 32) Peripheral Clock Status Register 1 -------- */
#define PMC_CSR1_PID32_Pos                    _UINT32_(0)                                          /* (PMC_CSR1) Peripheral Clock 32 Status Position */
#define PMC_CSR1_PID32_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID32_Pos)                /* (PMC_CSR1) Peripheral Clock 32 Status Mask */
#define PMC_CSR1_PID32(value)                 (PMC_CSR1_PID32_Msk & (_UINT32_(value) << PMC_CSR1_PID32_Pos)) /* Assigment of value for PID32 in the PMC_CSR1 register */
#define PMC_CSR1_PID33_Pos                    _UINT32_(1)                                          /* (PMC_CSR1) Peripheral Clock 33 Status Position */
#define PMC_CSR1_PID33_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID33_Pos)                /* (PMC_CSR1) Peripheral Clock 33 Status Mask */
#define PMC_CSR1_PID33(value)                 (PMC_CSR1_PID33_Msk & (_UINT32_(value) << PMC_CSR1_PID33_Pos)) /* Assigment of value for PID33 in the PMC_CSR1 register */
#define PMC_CSR1_PID36_Pos                    _UINT32_(4)                                          /* (PMC_CSR1) Peripheral Clock 36 Status Position */
#define PMC_CSR1_PID36_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID36_Pos)                /* (PMC_CSR1) Peripheral Clock 36 Status Mask */
#define PMC_CSR1_PID36(value)                 (PMC_CSR1_PID36_Msk & (_UINT32_(value) << PMC_CSR1_PID36_Pos)) /* Assigment of value for PID36 in the PMC_CSR1 register */
#define PMC_CSR1_PID38_Pos                    _UINT32_(6)                                          /* (PMC_CSR1) Peripheral Clock 38 Status Position */
#define PMC_CSR1_PID38_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID38_Pos)                /* (PMC_CSR1) Peripheral Clock 38 Status Mask */
#define PMC_CSR1_PID38(value)                 (PMC_CSR1_PID38_Msk & (_UINT32_(value) << PMC_CSR1_PID38_Pos)) /* Assigment of value for PID38 in the PMC_CSR1 register */
#define PMC_CSR1_PID44_Pos                    _UINT32_(12)                                         /* (PMC_CSR1) Peripheral Clock 44 Status Position */
#define PMC_CSR1_PID44_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID44_Pos)                /* (PMC_CSR1) Peripheral Clock 44 Status Mask */
#define PMC_CSR1_PID44(value)                 (PMC_CSR1_PID44_Msk & (_UINT32_(value) << PMC_CSR1_PID44_Pos)) /* Assigment of value for PID44 in the PMC_CSR1 register */
#define PMC_CSR1_PID45_Pos                    _UINT32_(13)                                         /* (PMC_CSR1) Peripheral Clock 45 Status Position */
#define PMC_CSR1_PID45_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID45_Pos)                /* (PMC_CSR1) Peripheral Clock 45 Status Mask */
#define PMC_CSR1_PID45(value)                 (PMC_CSR1_PID45_Msk & (_UINT32_(value) << PMC_CSR1_PID45_Pos)) /* Assigment of value for PID45 in the PMC_CSR1 register */
#define PMC_CSR1_PID50_Pos                    _UINT32_(18)                                         /* (PMC_CSR1) Peripheral Clock 50 Status Position */
#define PMC_CSR1_PID50_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID50_Pos)                /* (PMC_CSR1) Peripheral Clock 50 Status Mask */
#define PMC_CSR1_PID50(value)                 (PMC_CSR1_PID50_Msk & (_UINT32_(value) << PMC_CSR1_PID50_Pos)) /* Assigment of value for PID50 in the PMC_CSR1 register */
#define PMC_CSR1_PID53_Pos                    _UINT32_(21)                                         /* (PMC_CSR1) Peripheral Clock 53 Status Position */
#define PMC_CSR1_PID53_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID53_Pos)                /* (PMC_CSR1) Peripheral Clock 53 Status Mask */
#define PMC_CSR1_PID53(value)                 (PMC_CSR1_PID53_Msk & (_UINT32_(value) << PMC_CSR1_PID53_Pos)) /* Assigment of value for PID53 in the PMC_CSR1 register */
#define PMC_CSR1_PID54_Pos                    _UINT32_(22)                                         /* (PMC_CSR1) Peripheral Clock 54 Status Position */
#define PMC_CSR1_PID54_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID54_Pos)                /* (PMC_CSR1) Peripheral Clock 54 Status Mask */
#define PMC_CSR1_PID54(value)                 (PMC_CSR1_PID54_Msk & (_UINT32_(value) << PMC_CSR1_PID54_Pos)) /* Assigment of value for PID54 in the PMC_CSR1 register */
#define PMC_CSR1_PID55_Pos                    _UINT32_(23)                                         /* (PMC_CSR1) Peripheral Clock 55 Status Position */
#define PMC_CSR1_PID55_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID55_Pos)                /* (PMC_CSR1) Peripheral Clock 55 Status Mask */
#define PMC_CSR1_PID55(value)                 (PMC_CSR1_PID55_Msk & (_UINT32_(value) << PMC_CSR1_PID55_Pos)) /* Assigment of value for PID55 in the PMC_CSR1 register */
#define PMC_CSR1_PID59_Pos                    _UINT32_(27)                                         /* (PMC_CSR1) Peripheral Clock 59 Status Position */
#define PMC_CSR1_PID59_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID59_Pos)                /* (PMC_CSR1) Peripheral Clock 59 Status Mask */
#define PMC_CSR1_PID59(value)                 (PMC_CSR1_PID59_Msk & (_UINT32_(value) << PMC_CSR1_PID59_Pos)) /* Assigment of value for PID59 in the PMC_CSR1 register */
#define PMC_CSR1_PID63_Pos                    _UINT32_(31)                                         /* (PMC_CSR1) Peripheral Clock 63 Status Position */
#define PMC_CSR1_PID63_Msk                    (_UINT32_(0x1) << PMC_CSR1_PID63_Pos)                /* (PMC_CSR1) Peripheral Clock 63 Status Mask */
#define PMC_CSR1_PID63(value)                 (PMC_CSR1_PID63_Msk & (_UINT32_(value) << PMC_CSR1_PID63_Pos)) /* Assigment of value for PID63 in the PMC_CSR1 register */
#define PMC_CSR1_Msk                          _UINT32_(0x88E43053)                                 /* (PMC_CSR1) Register Mask  */

