Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pmc.h
#define PMC_CSR1_PID_Pos                      _UINT32_(0)                                          /* (PMC_CSR1 Position) Peripheral Clock 63 Status */
#define PMC_CSR1_PID_Msk                      (_UINT32_(0xFFF) << PMC_CSR1_PID_Pos)                /* (PMC_CSR1 Mask) PID */
#define PMC_CSR1_PID(value)                   (PMC_CSR1_PID_Msk & (_UINT32_(value) << PMC_CSR1_PID_Pos)) 

/* -------- PMC_CSR2 : (PMC Offset: 0x178) ( R/ 32) Peripheral Clock Status Register 2 -------- */
#define PMC_CSR2_PID64_Pos                    _UINT32_(0)                                          /* (PMC_CSR2) Peripheral Clock 64 Status Position */
#define PMC_CSR2_PID64_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID64_Pos)                /* (PMC_CSR2) Peripheral Clock 64 Status Mask */
#define PMC_CSR2_PID64(value)                 (PMC_CSR2_PID64_Msk & (_UINT32_(value) << PMC_CSR2_PID64_Pos)) /* Assigment of value for PID64 in the PMC_CSR2 register */
#define PMC_CSR2_PID65_Pos                    _UINT32_(1)                                          /* (PMC_CSR2) Peripheral Clock 65 Status Position */
#define PMC_CSR2_PID65_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID65_Pos)                /* (PMC_CSR2) Peripheral Clock 65 Status Mask */
#define PMC_CSR2_PID65(value)                 (PMC_CSR2_PID65_Msk & (_UINT32_(value) << PMC_CSR2_PID65_Pos)) /* Assigment of value for PID65 in the PMC_CSR2 register */
#define PMC_CSR2_PID66_Pos                    _UINT32_(2)                                          /* (PMC_CSR2) Peripheral Clock 66 Status Position */
#define PMC_CSR2_PID66_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID66_Pos)                /* (PMC_CSR2) Peripheral Clock 66 Status Mask */
#define PMC_CSR2_PID66(value)                 (PMC_CSR2_PID66_Msk & (_UINT32_(value) << PMC_CSR2_PID66_Pos)) /* Assigment of value for PID66 in the PMC_CSR2 register */
#define PMC_CSR2_PID68_Pos                    _UINT32_(4)                                          /* (PMC_CSR2) Peripheral Clock 68 Status Position */
#define PMC_CSR2_PID68_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID68_Pos)                /* (PMC_CSR2) Peripheral Clock 68 Status Mask */
#define PMC_CSR2_PID68(value)                 (PMC_CSR2_PID68_Msk & (_UINT32_(value) << PMC_CSR2_PID68_Pos)) /* Assigment of value for PID68 in the PMC_CSR2 register */
#define PMC_CSR2_Msk                          _UINT32_(0x00000017)                                 /* (PMC_CSR2) Register Mask  */

#define PMC_CSR2_PID_Pos                      _UINT32_(0)                                          /* (PMC_CSR2 Position) Peripheral Clock 68 Status */
#define PMC_CSR2_PID_Msk                      (_UINT32_(0xF) << PMC_CSR2_PID_Pos)                  /* (PMC_CSR2 Mask) PID */
#define PMC_CSR2_PID(value)                   (PMC_CSR2_PID_Msk & (_UINT32_(value) << PMC_CSR2_PID_Pos)) 

/* -------- PMC_CSR3 : (PMC Offset: 0x17C) ( R/ 32) Peripheral Clock Status Register 3 -------- */
#define PMC_CSR3_Msk                          _UINT32_(0x00000000)                                 /* (PMC_CSR3) Register Mask  */


/* -------- PMC_GCSR0 : (PMC Offset: 0x190) ( R/ 32) Generic Clock Status Register 0 -------- */
#define PMC_GCSR0_GPID7_Pos                   _UINT32_(7)                                          /* (PMC_GCSR0) Generic Clock 7 Status Position */
#define PMC_GCSR0_GPID7_Msk                   (_UINT32_(0x1) << PMC_GCSR0_GPID7_Pos)               /* (PMC_GCSR0) Generic Clock 7 Status Mask */
#define PMC_GCSR0_GPID7(value)                (PMC_GCSR0_GPID7_Msk & (_UINT32_(value) << PMC_GCSR0_GPID7_Pos)) /* Assigment of value for GPID7 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID8_Pos                   _UINT32_(8)                                          /* (PMC_GCSR0) Generic Clock 8 Status Position */
#define PMC_GCSR0_GPID8_Msk                   (_UINT32_(0x1) << PMC_GCSR0_GPID8_Pos)               /* (PMC_GCSR0) Generic Clock 8 Status Mask */
#define PMC_GCSR0_GPID8(value)                (PMC_GCSR0_GPID8_Msk & (_UINT32_(value) << PMC_GCSR0_GPID8_Pos)) /* Assigment of value for GPID8 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID9_Pos                   _UINT32_(9)                                          /* (PMC_GCSR0) Generic Clock 9 Status Position */
#define PMC_GCSR0_GPID9_Msk                   (_UINT32_(0x1) << PMC_GCSR0_GPID9_Pos)               /* (PMC_GCSR0) Generic Clock 9 Status Mask */
#define PMC_GCSR0_GPID9(value)                (PMC_GCSR0_GPID9_Msk & (_UINT32_(value) << PMC_GCSR0_GPID9_Pos)) /* Assigment of value for GPID9 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID13_Pos                  _UINT32_(13)                                         /* (PMC_GCSR0) Generic Clock 13 Status Position */
#define PMC_GCSR0_GPID13_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID13_Pos)              /* (PMC_GCSR0) Generic Clock 13 Status Mask */
#define PMC_GCSR0_GPID13(value)               (PMC_GCSR0_GPID13_Msk & (_UINT32_(value) << PMC_GCSR0_GPID13_Pos)) /* Assigment of value for GPID13 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID14_Pos                  _UINT32_(14)                                         /* (PMC_GCSR0) Generic Clock 14 Status Position */
#define PMC_GCSR0_GPID14_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID14_Pos)              /* (PMC_GCSR0) Generic Clock 14 Status Mask */
#define PMC_GCSR0_GPID14(value)               (PMC_GCSR0_GPID14_Msk & (_UINT32_(value) << PMC_GCSR0_GPID14_Pos)) /* Assigment of value for GPID14 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID23_Pos                  _UINT32_(23)                                         /* (PMC_GCSR0) Generic Clock 23 Status Position */
#define PMC_GCSR0_GPID23_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID23_Pos)              /* (PMC_GCSR0) Generic Clock 23 Status Mask */
#define PMC_GCSR0_GPID23(value)               (PMC_GCSR0_GPID23_Msk & (_UINT32_(value) << PMC_GCSR0_GPID23_Pos)) /* Assigment of value for GPID23 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID25_Pos                  _UINT32_(25)                                         /* (PMC_GCSR0) Generic Clock 25 Status Position */
#define PMC_GCSR0_GPID25_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID25_Pos)              /* (PMC_GCSR0) Generic Clock 25 Status Mask */
#define PMC_GCSR0_GPID25(value)               (PMC_GCSR0_GPID25_Msk & (_UINT32_(value) << PMC_GCSR0_GPID25_Pos)) /* Assigment of value for GPID25 in the PMC_GCSR0 register */
#define PMC_GCSR0_GPID28_Pos                  _UINT32_(28)                                         /* (PMC_GCSR0) Generic Clock 28 Status Position */
#define PMC_GCSR0_GPID28_Msk                  (_UINT32_(0x1) << PMC_GCSR0_GPID28_Pos)              /* (PMC_GCSR0) Generic Clock 28 Status Mask */
#define PMC_GCSR0_GPID28(value)               (PMC_GCSR0_GPID28_Msk & (_UINT32_(value) << PMC_GCSR0_GPID28_Pos)) /* Assigment of value for GPID28 in the PMC_GCSR0 register */
#define PMC_GCSR0_Msk                         _UINT32_(0x12806380)                                 /* (PMC_GCSR0) Register Mask  */

#define PMC_GCSR0_GPID_Pos                    _UINT32_(7)                                          /* (PMC_GCSR0 Position) Generic Clock 28 Status */
#define PMC_GCSR0_GPID_Msk                    (_UINT32_(0xFF) << PMC_GCSR0_GPID_Pos)               /* (PMC_GCSR0 Mask) GPID */
#define PMC_GCSR0_GPID(value)                 (PMC_GCSR0_GPID_Msk & (_UINT32_(value) << PMC_GCSR0_GPID_Pos)) 

/* -------- PMC_GCSR1 : (PMC Offset: 0x194) ( R/ 32) Generic Clock Status Register 1 -------- */
#define PMC_GCSR1_GPID36_Pos                  _UINT32_(4)                                          /* (PMC_GCSR1) Generic Clock 36 Status Position */
#define PMC_GCSR1_GPID36_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID36_Pos)              /* (PMC_GCSR1) Generic Clock 36 Status Mask */
#define PMC_GCSR1_GPID36(value)               (PMC_GCSR1_GPID36_Msk & (_UINT32_(value) << PMC_GCSR1_GPID36_Pos)) /* Assigment of value for GPID36 in the PMC_GCSR1 register */
#define PMC_GCSR1_GPID38_Pos                  _UINT32_(6)                                          /* (PMC_GCSR1) Generic Clock 38 Status Position */
#define PMC_GCSR1_GPID38_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID38_Pos)              /* (PMC_GCSR1) Generic Clock 38 Status Mask */
#define PMC_GCSR1_GPID38(value)               (PMC_GCSR1_GPID38_Msk & (_UINT32_(value) << PMC_GCSR1_GPID38_Pos)) /* Assigment of value for GPID38 in the PMC_GCSR1 register */
#define PMC_GCSR1_GPID50_Pos                  _UINT32_(18)                                         /* (PMC_GCSR1) Generic Clock 50 Status Position */
#define PMC_GCSR1_GPID50_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID50_Pos)              /* (PMC_GCSR1) Generic Clock 50 Status Mask */
#define PMC_GCSR1_GPID50(value)               (PMC_GCSR1_GPID50_Msk & (_UINT32_(value) << PMC_GCSR1_GPID50_Pos)) /* Assigment of value for GPID50 in the PMC_GCSR1 register */
#define PMC_GCSR1_GPID53_Pos                  _UINT32_(21)                                         /* (PMC_GCSR1) Generic Clock 53 Status Position */
#define PMC_GCSR1_GPID53_Msk                  (_UINT32_(0x1) << PMC_GCSR1_GPID53_Pos)              /* (PMC_GCSR1) Generic Clock 53 Status Mask */
#define PMC_GCSR1_GPID53(value)               (PMC_GCSR1_GPID53_Msk & (_UINT32_(value) << PMC_GCSR1_GPID53_Pos)) /* Assigment of value for GPID53 in the PMC_GCSR1 register */
#define PMC_GCSR1_Msk                         _UINT32_(0x00240050)                                 /* (PMC_GCSR1) Register Mask  */

#define PMC_GCSR1_GPID_Pos                    _UINT32_(4)                                          /* (PMC_GCSR1 Position) Generic Clock 53 Status */
#define PMC_GCSR1_GPID_Msk                    (_UINT32_(0xF) << PMC_GCSR1_GPID_Pos)                /* (PMC_GCSR1 Mask) GPID */
#define PMC_GCSR1_GPID(value)                 (PMC_GCSR1_GPID_Msk & (_UINT32_(value) << PMC_GCSR1_GPID_Pos)) 

/* -------- PMC_GCSR2 : (PMC Offset: 0x198) ( R/ 32) Generic Clock Status Register 2 -------- */
#define PMC_GCSR2_GPID65_Pos                  _UINT32_(1)                                          /* (PMC_GCSR2) Generic Clock 65 Status Position */
#define PMC_GCSR2_GPID65_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID65_Pos)              /* (PMC_GCSR2) Generic Clock 65 Status Mask */
#define PMC_GCSR2_GPID65(value)               (PMC_GCSR2_GPID65_Msk & (_UINT32_(value) << PMC_GCSR2_GPID65_Pos)) /* Assigment of value for GPID65 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID66_Pos                  _UINT32_(2)                                          /* (PMC_GCSR2) Generic Clock 66 Status Position */
#define PMC_GCSR2_GPID66_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID66_Pos)              /* (PMC_GCSR2) Generic Clock 66 Status Mask */
#define PMC_GCSR2_GPID66(value)               (PMC_GCSR2_GPID66_Msk & (_UINT32_(value) << PMC_GCSR2_GPID66_Pos)) /* Assigment of value for GPID66 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID68_Pos                  _UINT32_(4)                                          /* (PMC_GCSR2) Generic Clock 68 Status Position */
#define PMC_GCSR2_GPID68_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID68_Pos)              /* (PMC_GCSR2) Generic Clock 68 Status Mask */
#define PMC_GCSR2_GPID68(value)               (PMC_GCSR2_GPID68_Msk & (_UINT32_(value) << PMC_GCSR2_GPID68_Pos)) /* Assigment of value for GPID68 in the PMC_GCSR2 register */
#define PMC_GCSR2_Msk                         _UINT32_(0x00000016)                                 /* (PMC_GCSR2) Register Mask  */

#define PMC_GCSR2_GPID_Pos                    _UINT32_(1)                                          /* (PMC_GCSR2 Position) Generic Clock 68 Status */
#define PMC_GCSR2_GPID_Msk                    (_UINT32_(0x7) << PMC_GCSR2_GPID_Pos)                /* (PMC_GCSR2 Mask) GPID */
#define PMC_GCSR2_GPID(value)                 (PMC_GCSR2_GPID_Msk & (_UINT32_(value) << PMC_GCSR2_GPID_Pos)) 

