Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pmc.h
/* -------- PMC_GCSR3 : (PMC Offset: 0x19C) ( R/ 32) Generic Clock Status Register 3 -------- */
#define PMC_GCSR3_Msk                         _UINT32_(0x00000000)                                 /* (PMC_GCSR3) Register Mask  */


/* -------- PMC_OSC2 : (PMC Offset: 0x1B0) (R/W 32) Oscillator Control Register 2 -------- */
#define PMC_OSC2_EN_Pos                       _UINT32_(0)                                          /* (PMC_OSC2) Enable Position */
#define PMC_OSC2_EN_Msk                       (_UINT32_(0x1) << PMC_OSC2_EN_Pos)                   /* (PMC_OSC2) Enable Mask */
#define PMC_OSC2_EN(value)                    (PMC_OSC2_EN_Msk & (_UINT32_(value) << PMC_OSC2_EN_Pos)) /* Assigment of value for EN in the PMC_OSC2 register */
#define PMC_OSC2_OSCRCF_Pos                   _UINT32_(4)                                          /* (PMC_OSC2) 2nd Oscillator Frequency Selection Position */
#define PMC_OSC2_OSCRCF_Msk                   (_UINT32_(0x3) << PMC_OSC2_OSCRCF_Pos)               /* (PMC_OSC2) 2nd Oscillator Frequency Selection Mask */
#define PMC_OSC2_OSCRCF(value)                (PMC_OSC2_OSCRCF_Msk & (_UINT32_(value) << PMC_OSC2_OSCRCF_Pos)) /* Assigment of value for OSCRCF in the PMC_OSC2 register */
#define   PMC_OSC2_OSCRCF_4_MHz_Val           _UINT32_(0x0)                                        /* (PMC_OSC2) The 2nd RC oscillator frequency is at 4 MHz  */
#define   PMC_OSC2_OSCRCF_8_MHz_Val           _UINT32_(0x1)                                        /* (PMC_OSC2) The 2nd RC oscillator frequency is at 8 MHz  */
#define   PMC_OSC2_OSCRCF_10_MHz_Val          _UINT32_(0x2)                                        /* (PMC_OSC2) The 2nd RC oscillator frequency is at 10 MHz  */
#define   PMC_OSC2_OSCRCF_12_MHz_Val          _UINT32_(0x3)                                        /* (PMC_OSC2) The 2nd RC oscillator frequency is at 12 MHz  */
#define PMC_OSC2_OSCRCF_4_MHz                 (PMC_OSC2_OSCRCF_4_MHz_Val << PMC_OSC2_OSCRCF_Pos)   /* (PMC_OSC2) The 2nd RC oscillator frequency is at 4 MHz Position  */
#define PMC_OSC2_OSCRCF_8_MHz                 (PMC_OSC2_OSCRCF_8_MHz_Val << PMC_OSC2_OSCRCF_Pos)   /* (PMC_OSC2) The 2nd RC oscillator frequency is at 8 MHz Position  */
#define PMC_OSC2_OSCRCF_10_MHz                (PMC_OSC2_OSCRCF_10_MHz_Val << PMC_OSC2_OSCRCF_Pos)  /* (PMC_OSC2) The 2nd RC oscillator frequency is at 10 MHz Position  */
#define PMC_OSC2_OSCRCF_12_MHz                (PMC_OSC2_OSCRCF_12_MHz_Val << PMC_OSC2_OSCRCF_Pos)  /* (PMC_OSC2) The 2nd RC oscillator frequency is at 12 MHz Position  */
#define PMC_OSC2_EN_WR_CALIB_Pos              _UINT32_(8)                                          /* (PMC_OSC2) Enable Calibration Register Write Position */
#define PMC_OSC2_EN_WR_CALIB_Msk              (_UINT32_(0x1) << PMC_OSC2_EN_WR_CALIB_Pos)          /* (PMC_OSC2) Enable Calibration Register Write Mask */
#define PMC_OSC2_EN_WR_CALIB(value)           (PMC_OSC2_EN_WR_CALIB_Msk & (_UINT32_(value) << PMC_OSC2_EN_WR_CALIB_Pos)) /* Assigment of value for EN_WR_CALIB in the PMC_OSC2 register */
#define PMC_OSC2_KEY_Pos                      _UINT32_(16)                                         /* (PMC_OSC2) Register Write Access Password Position */
#define PMC_OSC2_KEY_Msk                      (_UINT32_(0xFF) << PMC_OSC2_KEY_Pos)                 /* (PMC_OSC2) Register Write Access Password Mask */
#define PMC_OSC2_KEY(value)                   (PMC_OSC2_KEY_Msk & (_UINT32_(value) << PMC_OSC2_KEY_Pos)) /* Assigment of value for KEY in the PMC_OSC2 register */
#define   PMC_OSC2_KEY_PASSWD_Val             _UINT32_(0x37)                                       /* (PMC_OSC2) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define PMC_OSC2_KEY_PASSWD                   (PMC_OSC2_KEY_PASSWD_Val << PMC_OSC2_KEY_Pos)        /* (PMC_OSC2) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define PMC_OSC2_Msk                          _UINT32_(0x00FF0131)                                 /* (PMC_OSC2) Register Mask  */


/* -------- PMC_OCR2 : (PMC Offset: 0x1B4) (R/W 32) Oscillator Calibration Register 2 -------- */
#define PMC_OCR2_CAL4_Pos                     _UINT32_(0)                                          /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR2_CAL4_Msk                     (_UINT32_(0x7F) << PMC_OCR2_CAL4_Pos)                /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR2_CAL4(value)                  (PMC_OCR2_CAL4_Msk & (_UINT32_(value) << PMC_OCR2_CAL4_Pos)) /* Assigment of value for CAL4 in the PMC_OCR2 register */
#define PMC_OCR2_SEL4_Pos                     _UINT32_(7)                                          /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR2_SEL4_Msk                     (_UINT32_(0x1) << PMC_OCR2_SEL4_Pos)                 /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR2_SEL4(value)                  (PMC_OCR2_SEL4_Msk & (_UINT32_(value) << PMC_OCR2_SEL4_Pos)) /* Assigment of value for SEL4 in the PMC_OCR2 register */
#define PMC_OCR2_CAL8_Pos                     _UINT32_(8)                                          /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR2_CAL8_Msk                     (_UINT32_(0x7F) << PMC_OCR2_CAL8_Pos)                /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR2_CAL8(value)                  (PMC_OCR2_CAL8_Msk & (_UINT32_(value) << PMC_OCR2_CAL8_Pos)) /* Assigment of value for CAL8 in the PMC_OCR2 register */
#define PMC_OCR2_SEL8_Pos                     _UINT32_(15)                                         /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR2_SEL8_Msk                     (_UINT32_(0x1) << PMC_OCR2_SEL8_Pos)                 /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR2_SEL8(value)                  (PMC_OCR2_SEL8_Msk & (_UINT32_(value) << PMC_OCR2_SEL8_Pos)) /* Assigment of value for SEL8 in the PMC_OCR2 register */
#define PMC_OCR2_CAL12_Pos                    _UINT32_(16)                                         /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR2_CAL12_Msk                    (_UINT32_(0x7F) << PMC_OCR2_CAL12_Pos)               /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR2_CAL12(value)                 (PMC_OCR2_CAL12_Msk & (_UINT32_(value) << PMC_OCR2_CAL12_Pos)) /* Assigment of value for CAL12 in the PMC_OCR2 register */
#define PMC_OCR2_SEL12_Pos                    _UINT32_(23)                                         /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR2_SEL12_Msk                    (_UINT32_(0x1) << PMC_OCR2_SEL12_Pos)                /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR2_SEL12(value)                 (PMC_OCR2_SEL12_Msk & (_UINT32_(value) << PMC_OCR2_SEL12_Pos)) /* Assigment of value for SEL12 in the PMC_OCR2 register */
#define PMC_OCR2_CAL10_Pos                    _UINT32_(24)                                         /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR2_CAL10_Msk                    (_UINT32_(0x7F) << PMC_OCR2_CAL10_Pos)               /* (PMC_OCR2) Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR2_CAL10(value)                 (PMC_OCR2_CAL10_Msk & (_UINT32_(value) << PMC_OCR2_CAL10_Pos)) /* Assigment of value for CAL10 in the PMC_OCR2 register */
#define PMC_OCR2_SEL10_Pos                    _UINT32_(31)                                         /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR2_SEL10_Msk                    (_UINT32_(0x1) << PMC_OCR2_SEL10_Pos)                /* (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR2_SEL10(value)                 (PMC_OCR2_SEL10_Msk & (_UINT32_(value) << PMC_OCR2_SEL10_Pos)) /* Assigment of value for SEL10 in the PMC_OCR2 register */
#define PMC_OCR2_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PMC_OCR2) Register Mask  */


/** \brief PMC register offsets definitions */
#define PMC_SCER_REG_OFST              _UINT32_(0x00)      /* (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_REG_OFST              _UINT32_(0x04)      /* (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_REG_OFST              _UINT32_(0x08)      /* (PMC_SCSR) System Clock Status Register Offset */
#define CKGR_MOR_REG_OFST              _UINT32_(0x20)      /* (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_REG_OFST             _UINT32_(0x24)      /* (CKGR_MCFR) Main Clock Frequency Register Offset */
#define CKGR_PLLAR_REG_OFST            _UINT32_(0x28)      /* (CKGR_PLLAR) PLLA Register Offset */
#define CKGR_PLLBR_REG_OFST            _UINT32_(0x2C)      /* (CKGR_PLLBR) PLLB Register Offset */
#define PMC_MCKR_REG_OFST              _UINT32_(0x30)      /* (PMC_MCKR) Master Clock Register Offset */
#define PMC_PCK_REG_OFST               _UINT32_(0x40)      /* (PMC_PCK) Programmable Clock Register Offset */
#define PMC_PCK0_REG_OFST              _UINT32_(0x40)      /* (PMC_PCK0) Programmable Clock Register Offset */
#define PMC_PCK1_REG_OFST              _UINT32_(0x44)      /* (PMC_PCK1) Programmable Clock Register Offset */
#define PMC_PCK2_REG_OFST              _UINT32_(0x48)      /* (PMC_PCK2) Programmable Clock Register Offset */
#define PMC_PCK3_REG_OFST              _UINT32_(0x4C)      /* (PMC_PCK3) Programmable Clock Register Offset */
#define PMC_IER_REG_OFST               _UINT32_(0x60)      /* (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_REG_OFST               _UINT32_(0x64)      /* (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_REG_OFST                _UINT32_(0x68)      /* (PMC_SR) Status Register Offset */
#define PMC_IMR_REG_OFST               _UINT32_(0x6C)      /* (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FOCR_REG_OFST              _UINT32_(0x78)      /* (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_PLL_CFG_REG_OFST           _UINT32_(0x80)      /* (PMC_PLL_CFG) PLL Configuration Register Offset */
#define PMC_WPMR_REG_OFST              _UINT32_(0xE4)      /* (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_REG_OFST              _UINT32_(0xE8)      /* (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCR_REG_OFST               _UINT32_(0x10C)     /* (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR1_REG_OFST              _UINT32_(0x110)     /* (PMC_OCR1) Oscillator Calibration Register Offset */
#define PMC_PMMR_REG_OFST              _UINT32_(0x130)     /* (PMC_PMMR) PLL Maximum Multiplier Value Register Offset */
#define PMC_CPULIM_REG_OFST            _UINT32_(0x160)     /* (PMC_CPULIM) CPU Monitor Limits Register Offset */
#define PMC_CSR0_REG_OFST              _UINT32_(0x170)     /* (PMC_CSR0) Peripheral Clock Status Register 0 Offset */
#define PMC_CSR1_REG_OFST              _UINT32_(0x174)     /* (PMC_CSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_CSR2_REG_OFST              _UINT32_(0x178)     /* (PMC_CSR2) Peripheral Clock Status Register 2 Offset */
#define PMC_CSR3_REG_OFST              _UINT32_(0x17C)     /* (PMC_CSR3) Peripheral Clock Status Register 3 Offset */
#define PMC_GCSR0_REG_OFST             _UINT32_(0x190)     /* (PMC_GCSR0) Generic Clock Status Register 0 Offset */
#define PMC_GCSR1_REG_OFST             _UINT32_(0x194)     /* (PMC_GCSR1) Generic Clock Status Register 1 Offset */
#define PMC_GCSR2_REG_OFST             _UINT32_(0x198)     /* (PMC_GCSR2) Generic Clock Status Register 2 Offset */
#define PMC_GCSR3_REG_OFST             _UINT32_(0x19C)     /* (PMC_GCSR3) Generic Clock Status Register 3 Offset */
#define PMC_OSC2_REG_OFST              _UINT32_(0x1B0)     /* (PMC_OSC2) Oscillator Control Register 2 Offset */
#define PMC_OCR2_REG_OFST              _UINT32_(0x1B4)     /* (PMC_OCR2) Oscillator Calibration Register 2 Offset */

